{
    "source_file": ":contentReference[oaicite:0]{index=0}",
    "resume_date": "9/22/2025",
    "name": "Timothy Panilaitis",
    "contact": {
        "phone": "978-437-0931",
        "email": "timothy.panilaitis@tufts.edu"
    },
    "education": {
        "school": "Tufts School of Engineering",
        "location": "Medford, MA",
        "degree": "Bachelor of Science in Computer Science",
        "minor": "Human Factors Engineering",
        "expected_graduation": "May 2027",
        "gpa": 3.68,
        "honors": [
            "Dean's List"
        ],
        "relevant_courses": [
            "Algorithms",
            "Machine Structure and Programming",
            "Tech and Managerial Communication",
            "Linear Algebra",
            "Product Design",
            "Probability and Statistics",
            "Web Development",
            "Machine Learning",
            "Artificial Intelligence"
        ]
    },
    "technical_skills": {
        "programming_languages": [
            "C",
            "C++",
            "Python",
            "React",
            "HTML",
            "PHP",
            "SQL",
            "NoSQL"
        ],
        "tools_and_frameworks": [
            "GitHub",
            "scikit-learn",
            "pytorch",
            "MATLAB",
            "Arduino",
            "Microsoft Office",
            "ROS1"
        ]
    },
    "project_experience": [
            {
            "title": "Clash Royale Elixer Tracker",
            "organization": "Personal",
            "dates": "October 2025 - Present",
            "details": [
                "Currently developing a computer vision system to track opponent elixir, starting with detecting and classifying enemy troops from gameplay using PyTorch CNNs, aiming for real-time in-game analysis.",
                "Built and tested the first Dataset and DataLoader pipeline to efficiently process raw gameplay data, enabling initial model training and evaluation.",
                "Began training the initial CNN architecture with preprocessing and evaluation, and implemented pytest-based unit tests to ensure reliability of the dataset and model outputs."
            ]
            }, {
            "title": "LockedIn Accountability App",
            "organization": "Personal",
            "dates": "December 2024 - Present",
            "details": [
                "Architected and developed a cross-platform mobile ecosystem using React Native and Typescript, deploying to IOS, Android and Web platforms with 95% code reuse across unified codebase.",
                "Designed and normalized a PostgreSQL database with 10+ interrelated tables, incorporating stored procedures, database triggers, and Row-Level Security (RLS) policies to enforce data integrity and granular access control",
                "Developed a secure authentication system leveraging JWT tokens, email verification, and password reset flows, alongside a hybrid secure storage solution (SecureStore, AsyncStorage) to protest user credentials across platforms.",
                "Implemented real-time social features, including a friend system, ephemeral stores with 24-hour auto-expiration, group chat, and push notifications powered by Firebase, enabling seamless, dynamic user interaction."
            ]
            }, {
            "title": "COMP 135: Machine Learning Coursework Projects",
            "organization": "Tufts University",
            "dates": "May - August 2025",
            "details": [
                "Applied feature engineering to a training set to improve the classification accuracy of a logistic regression model using image sharpening, feature selection strategies, and k-fold valuation.",
                "Built familiarity with scikit-learn's training parameters and error metrics through iterative testing to practice real field work."]
            }, {
            "title": "JumboHack",
            "organization": "Tufts University",
            "dates": "February 2025",
            "details": [
                "Prototyped an accessibility device in team of 2 that converts text or pdf files into arduino motor instructions for braille printing through a C++/Arduino codebase.",
                "Implemented prototype by comparing traits of printing stamp design while balancing the limitations of our 3-person Mechanical Engineering team.",
                "Conducted research on braille accessibility device market and interviewed potential product users from the Massachusetts Association for the Blind and Visually Impaired to explore commercial viability"
            ]
        }
    ],
    "work_experience": [{
        "organization": "Tufts University",
        "location": "Medford, MA",
        "title": "Human Robot Interaction Researcher",
        "dates": "September 2025 - Present",
        "details": [
            "Restored an existing depreciated Python/ROS codebase through research into new and depreciated documentation to manage local and global goals with a vector-field based approach.",
            "Improved 5-step sensor to movement pipeline by reworking the obstacle avoidance module to follow OOP principles, allowing the robot to accurately and quickly avoid non-static obstacles while moving.",
            "Managed 10 hours of weekly individual work by effectively communicating with leadership and maintaining organization with Github to contribute maximum value."
        ]
        }, {
        "organization": "Tufts University",
        "location": "Medford, MA",
        "title": "Web Programming Teaching Assistant",
        "dates": "September 2025 - Present",
        "details": [
            "Provide technical assistance to ~18 students by answering ~4 piazza questions, grading ~10 assignments, and leading ~60 minutes of office hours weekly to help foster full stack programming skills at a graduate level."
        ]
        }, {
        "organization": "Tufts University",
        "location": "Medford, MA",
        "title": "Campus Center Manager",
        "dates": "December 2024 - Present",
        "details": [
            "Ensured smooth operations and building security as the sole authority during shifts through regular monitoring.",
            "Assisted students and campus groups with information and problem resolution, fostering a supportive campus environment."
        ]
        }
    ],
    "notes": {
        "contact_mailto": "mailto:timothy.panilaitis@tufts.edu"
    }
}
